OF_Model/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "constant/triSurface/col_model.fms";

minCellSize 0.25;

maxCellSize 0.25;

/* boundaryCellSize 0.1; */

/* boundaryCellSizeRefinementThickness 1; */

localRefinement
{
    "grain*"
    {
        additionalRefinementLevel 2;
        refinementThickness 0.25;
    }
}


// ************************************************************************* //
