OF_Model/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet.stl
    {
        type            zeroGradient;
    }

    outlet.stl
    {
        type            fixedValue;
        value uniform   0;
    }

    wall_up.stl
    {
        type            zeroGradient;
    }

    wall_down.stl
    {
        type            zeroGradient;
    }

    cover_up.stl
    {
        type            empty;
    }   

    cover_down.stl
    {
        type            empty;
    }

    grain_4_11.stl
    {
        type            zeroGradient;
    }
    grain_4_30.stl
    {
        type            zeroGradient;
    }
    grain_4_61.stl
    {
        type            zeroGradient;
    }
    grain_5_17.stl
    {
        type            zeroGradient;
    }
    grain_5_24.stl
    {
        type            zeroGradient;
    }
    grain_5_29.stl
    {
        type            zeroGradient;
    }
    grain_6_7.stl
    {
        type            zeroGradient;
    }
    grain_6_9.stl
    {
        type            zeroGradient;
    }
    grain_6_15.stl
    {
        type            zeroGradient;
    }
    grain_6_21.stl
    {
        type            zeroGradient;
    }
    grain_6_25.stl
    {
        type            zeroGradient;
    }
    grain_6_29.stl
    {
        type            zeroGradient;
    }
    grain_6_30.stl
    {
        type            zeroGradient;
    }
    grain_6_32.stl
    {
        type            zeroGradient;
    }
    grain_7_18.stl
    {
        type            zeroGradient;
    }
    grain_7_36.stl
    {
        type            zeroGradient;
    }
    grain_7_38.stl
    {
        type            zeroGradient;
    }
    grain_8_7.stl
    {
        type            zeroGradient;
    }
    grain_8_9.stl
    {
        type            zeroGradient;
    }
    grain_8_12.stl
    {
        type            zeroGradient;
    }
    grain_8_13.stl
    {
        type            zeroGradient;
    }
    grain_8_22.stl
    {
        type            zeroGradient;
    }
    grain_8_29.stl
    {
        type            zeroGradient;
    }
    grain_8_55.stl
    {
        type            zeroGradient;
    }
    grain_8_62.stl
    {
        type            zeroGradient;
    }
    grain_9_4.stl
    {
        type            zeroGradient;
    }
    grain_9_7.stl
    {
        type            zeroGradient;
    }
    grain_9_17.stl
    {
        type            zeroGradient;
    }
    grain_9_23.stl
    {
        type            zeroGradient;
    }
    grain_9_39.stl
    {
        type            zeroGradient;
    }
    grain_9_40.stl
    {
        type            zeroGradient;
    }
    grain_9_42.stl
    {
        type            zeroGradient;
    }
    grain_10_1.stl
    {
        type            zeroGradient;
    }
    grain_10_5.stl
    {
        type            zeroGradient;
    }
    grain_10_11.stl
    {
        type            zeroGradient;
    }
    grain_10_15.stl
    {
        type            zeroGradient;
    }
    grain_10_37.stl
    {
        type            zeroGradient;
    }
    grain_10_51.stl
    {
        type            zeroGradient;
    }
    grain_10_60.stl
    {
        type            zeroGradient;
    }
    grain_10_63.stl
    {
        type            zeroGradient;
    }
    grain_11_14.stl
    {
        type            zeroGradient;
    }
    grain_11_37.stl
    {
        type            zeroGradient;
    }
    grain_11_39.stl
    {
        type            zeroGradient;
    }
    grain_11_44.stl
    {
        type            zeroGradient;
    }
    grain_11_47.stl
    {
        type            zeroGradient;
    }
    grain_11_51.stl
    {
        type            zeroGradient;
    }
    grain_12_6.stl
    {
        type            zeroGradient;
    }
    grain_12_16.stl
    {
        type            zeroGradient;
    }
    grain_12_19.stl
    {
        type            zeroGradient;
    }
    grain_12_20.stl
    {
        type            zeroGradient;
    }
    grain_12_22.stl
    {
        type            zeroGradient;
    }
    grain_12_26.stl
    {
        type            zeroGradient;
    }
    grain_12_39.stl
    {
        type            zeroGradient;
    }
    grain_12_43.stl
    {
        type            zeroGradient;
    }
    grain_12_47.stl
    {
        type            zeroGradient;
    }
    grain_12_48.stl
    {
        type            zeroGradient;
    }
    grain_12_63.stl
    {
        type            zeroGradient;
    }
    grain_13_24.stl
    {
        type            zeroGradient;
    }
    grain_13_40.stl
    {
        type            zeroGradient;
    }
    grain_13_44.stl
    {
        type            zeroGradient;
    }
    grain_13_45.stl
    {
        type            zeroGradient;
    }
    grain_14_16.stl
    {
        type            zeroGradient;
    }
    grain_14_35.stl
    {
        type            zeroGradient;
    }
    grain_14_37.stl
    {
        type            zeroGradient;
    }
    grain_14_41.stl
    {
        type            zeroGradient;
    }
    grain_14_53.stl
    {
        type            zeroGradient;
    }
    grain_15_22.stl
    {
        type            zeroGradient;
    }
    grain_15_23.stl
    {
        type            zeroGradient;
    }
    grain_15_29.stl
    {
        type            zeroGradient;
    }
    grain_15_30.stl
    {
        type            zeroGradient;
    }
    grain_15_35.stl
    {
        type            zeroGradient;
    }
    grain_15_38.stl
    {
        type            zeroGradient;
    }
    grain_15_43.stl
    {
        type            zeroGradient;
    }
    grain_15_47.stl
    {
        type            zeroGradient;
    }
    grain_15_54.stl
    {
        type            zeroGradient;
    }
    grain_15_60.stl
    {
        type            zeroGradient;
    }
    grain_16_1.stl
    {
        type            zeroGradient;
    }
    grain_16_12.stl
    {
        type            zeroGradient;
    }
    grain_16_32.stl
    {
        type            zeroGradient;
    }
    grain_16_33.stl
    {
        type            zeroGradient;
    }
    grain_16_40.stl
    {
        type            zeroGradient;
    }
    grain_16_41.stl
    {
        type            zeroGradient;
    }
    grain_17_16.stl
    {
        type            zeroGradient;
    }
    grain_17_26.stl
    {
        type            zeroGradient;
    }
    grain_17_29.stl
    {
        type            zeroGradient;
    }
    grain_17_52.stl
    {
        type            zeroGradient;
    }
    grain_17_60.stl
    {
        type            zeroGradient;
    }
    grain_17_61.stl
    {
        type            zeroGradient;
    }
    grain_18_8.stl
    {
        type            zeroGradient;
    }
    grain_18_12.stl
    {
        type            zeroGradient;
    }
    grain_18_15.stl
    {
        type            zeroGradient;
    }
    grain_18_46.stl
    {
        type            zeroGradient;
    }
    grain_19_29.stl
    {
        type            zeroGradient;
    }
    grain_19_36.stl
    {
        type            zeroGradient;
    }
    grain_19_47.stl
    {
        type            zeroGradient;
    }
    grain_19_48.stl
    {
        type            zeroGradient;
    }
    grain_19_58.stl
    {
        type            zeroGradient;
    }
    grain_19_60.stl
    {
        type            zeroGradient;
    }
    grain_19_63.stl
    {
        type            zeroGradient;
    }
    grain_20_2.stl
    {
        type            zeroGradient;
    }
    grain_20_6.stl
    {
        type            zeroGradient;
    }
    grain_20_17.stl
    {
        type            zeroGradient;
    }
    grain_20_24.stl
    {
        type            zeroGradient;
    }
    grain_20_42.stl
    {
        type            zeroGradient;
    }
    grain_20_45.stl
    {
        type            zeroGradient;
    }
    grain_20_46.stl
    {
        type            zeroGradient;
    }
    grain_21_11.stl
    {
        type            zeroGradient;
    }
    grain_21_20.stl
    {
        type            zeroGradient;
    }
    grain_21_27.stl
    {
        type            zeroGradient;
    }
    grain_21_58.stl
    {
        type            zeroGradient;
    }
    grain_22_12.stl
    {
        type            zeroGradient;
    }
    grain_22_18.stl
    {
        type            zeroGradient;
    }
    grain_22_22.stl
    {
        type            zeroGradient;
    }
    grain_22_24.stl
    {
        type            zeroGradient;
    }
    grain_22_39.stl
    {
        type            zeroGradient;
    }
    grain_22_53.stl
    {
        type            zeroGradient;
    }
    grain_22_56.stl
    {
        type            zeroGradient;
    }
    grain_23_5.stl
    {
        type            zeroGradient;
    }
    grain_23_9.stl
    {
        type            zeroGradient;
    }
    grain_23_14.stl
    {
        type            zeroGradient;
    }
    grain_23_21.stl
    {
        type            zeroGradient;
    }
    grain_23_24.stl
    {
        type            zeroGradient;
    }
    grain_24_13.stl
    {
        type            zeroGradient;
    }
    grain_24_20.stl
    {
        type            zeroGradient;
    }
    grain_24_48.stl
    {
        type            zeroGradient;
    }
    grain_24_51.stl
    {
        type            zeroGradient;
    }
    grain_24_58.stl
    {
        type            zeroGradient;
    }
    grain_24_61.stl
    {
        type            zeroGradient;
    }
    grain_25_0.stl
    {
        type            zeroGradient;
    }
    grain_25_2.stl
    {
        type            zeroGradient;
    }
    grain_25_14.stl
    {
        type            zeroGradient;
    }
    grain_25_15.stl
    {
        type            zeroGradient;
    }
    grain_25_42.stl
    {
        type            zeroGradient;
    }
    grain_25_45.stl
    {
        type            zeroGradient;
    }
    grain_25_50.stl
    {
        type            zeroGradient;
    }
    grain_25_57.stl
    {
        type            zeroGradient;
    }
    grain_25_58.stl
    {
        type            zeroGradient;
    }
    grain_26_12.stl
    {
        type            zeroGradient;
    }
    grain_26_18.stl
    {
        type            zeroGradient;
    }
    grain_26_20.stl
    {
        type            zeroGradient;
    }
    grain_26_34.stl
    {
        type            zeroGradient;
    }
    grain_26_45.stl
    {
        type            zeroGradient;
    }
    grain_26_55.stl
    {
        type            zeroGradient;
    }
    grain_26_62.stl
    {
        type            zeroGradient;
    }
    grain_27_4.stl
    {
        type            zeroGradient;
    }
    grain_27_15.stl
    {
        type            zeroGradient;
    }
    grain_27_16.stl
    {
        type            zeroGradient;
    }
    grain_27_19.stl
    {
        type            zeroGradient;
    }
    grain_27_26.stl
    {
        type            zeroGradient;
    }
    grain_27_36.stl
    {
        type            zeroGradient;
    }
    grain_27_42.stl
    {
        type            zeroGradient;
    }
    grain_27_44.stl
    {
        type            zeroGradient;
    }
    grain_27_54.stl
    {
        type            zeroGradient;
    }
    grain_27_57.stl
    {
        type            zeroGradient;
    }
    grain_28_14.stl
    {
        type            zeroGradient;
    }
    grain_28_37.stl
    {
        type            zeroGradient;
    }
    grain_28_38.stl
    {
        type            zeroGradient;
    }
    grain_28_43.stl
    {
        type            zeroGradient;
    }
    grain_28_57.stl
    {
        type            zeroGradient;
    }
    grain_28_60.stl
    {
        type            zeroGradient;
    }
    grain_28_63.stl
    {
        type            zeroGradient;
    }
    grain_29_4.stl
    {
        type            zeroGradient;
    }
    grain_29_14.stl
    {
        type            zeroGradient;
    }
    grain_29_30.stl
    {
        type            zeroGradient;
    }
    grain_29_34.stl
    {
        type            zeroGradient;
    }
    grain_29_44.stl
    {
        type            zeroGradient;
    }
    grain_29_48.stl
    {
        type            zeroGradient;
    }
    grain_30_21.stl
    {
        type            zeroGradient;
    }
    grain_30_33.stl
    {
        type            zeroGradient;
    }
    grain_30_41.stl
    {
        type            zeroGradient;
    }
    grain_30_53.stl
    {
        type            zeroGradient;
    }
    grain_30_63.stl
    {
        type            zeroGradient;
    }
    grain_31_5.stl
    {
        type            zeroGradient;
    }
    grain_31_7.stl
    {
        type            zeroGradient;
    }
    grain_31_25.stl
    {
        type            zeroGradient;
    }
    grain_31_32.stl
    {
        type            zeroGradient;
    }
    grain_31_34.stl
    {
        type            zeroGradient;
    }
    grain_31_45.stl
    {
        type            zeroGradient;
    }
    grain_31_48.stl
    {
        type            zeroGradient;
    }
    grain_32_5.stl
    {
        type            zeroGradient;
    }
    grain_32_9.stl
    {
        type            zeroGradient;
    }
    grain_32_11.stl
    {
        type            zeroGradient;
    }
    grain_32_12.stl
    {
        type            zeroGradient;
    }
    grain_32_42.stl
    {
        type            zeroGradient;
    }
    grain_32_45.stl
    {
        type            zeroGradient;
    }
    grain_32_50.stl
    {
        type            zeroGradient;
    }
    grain_32_51.stl
    {
        type            zeroGradient;
    }
    grain_33_9.stl
    {
        type            zeroGradient;
    }
    grain_33_10.stl
    {
        type            zeroGradient;
    }
    grain_33_29.stl
    {
        type            zeroGradient;
    }
    grain_33_36.stl
    {
        type            zeroGradient;
    }
    grain_33_41.stl
    {
        type            zeroGradient;
    }
    grain_33_52.stl
    {
        type            zeroGradient;
    }
    grain_34_7.stl
    {
        type            zeroGradient;
    }
    grain_34_18.stl
    {
        type            zeroGradient;
    }
    grain_34_19.stl
    {
        type            zeroGradient;
    }
    grain_34_45.stl
    {
        type            zeroGradient;
    }
    grain_34_55.stl
    {
        type            zeroGradient;
    }
    grain_34_63.stl
    {
        type            zeroGradient;
    }
    grain_35_27.stl
    {
        type            zeroGradient;
    }
    grain_35_43.stl
    {
        type            zeroGradient;
    }
    grain_35_46.stl
    {
        type            zeroGradient;
    }
    grain_35_48.stl
    {
        type            zeroGradient;
    }
    grain_36_12.stl
    {
        type            zeroGradient;
    }
    grain_36_19.stl
    {
        type            zeroGradient;
    }
    grain_36_21.stl
    {
        type            zeroGradient;
    }
    grain_36_30.stl
    {
        type            zeroGradient;
    }
    grain_36_33.stl
    {
        type            zeroGradient;
    }
    grain_36_53.stl
    {
        type            zeroGradient;
    }
    grain_37_3.stl
    {
        type            zeroGradient;
    }
    grain_37_30.stl
    {
        type            zeroGradient;
    }
    grain_37_46.stl
    {
        type            zeroGradient;
    }
    grain_38_3.stl
    {
        type            zeroGradient;
    }
    grain_38_7.stl
    {
        type            zeroGradient;
    }
    grain_38_23.stl
    {
        type            zeroGradient;
    }
    grain_38_24.stl
    {
        type            zeroGradient;
    }
    grain_38_34.stl
    {
        type            zeroGradient;
    }
    grain_38_47.stl
    {
        type            zeroGradient;
    }
    grain_38_50.stl
    {
        type            zeroGradient;
    }
    grain_38_51.stl
    {
        type            zeroGradient;
    }
    grain_39_11.stl
    {
        type            zeroGradient;
    }
    grain_39_32.stl
    {
        type            zeroGradient;
    }
    grain_39_39.stl
    {
        type            zeroGradient;
    }
    grain_39_40.stl
    {
        type            zeroGradient;
    }
    grain_39_44.stl
    {
        type            zeroGradient;
    }
    grain_40_47.stl
    {
        type            zeroGradient;
    }
    grain_40_63.stl
    {
        type            zeroGradient;
    }
    grain_41_14.stl
    {
        type            zeroGradient;
    }
    grain_41_18.stl
    {
        type            zeroGradient;
    }
    grain_41_39.stl
    {
        type            zeroGradient;
    }
    grain_41_45.stl
    {
        type            zeroGradient;
    }
    grain_41_53.stl
    {
        type            zeroGradient;
    }
    grain_41_55.stl
    {
        type            zeroGradient;
    }
    grain_42_2.stl
    {
        type            zeroGradient;
    }
    grain_42_10.stl
    {
        type            zeroGradient;
    }
    grain_42_21.stl
    {
        type            zeroGradient;
    }
    grain_42_25.stl
    {
        type            zeroGradient;
    }
    grain_42_39.stl
    {
        type            zeroGradient;
    }
    grain_42_50.stl
    {
        type            zeroGradient;
    }
    grain_42_51.stl
    {
        type            zeroGradient;
    }
    grain_43_2.stl
    {
        type            zeroGradient;
    }
    grain_43_4.stl
    {
        type            zeroGradient;
    }
    grain_43_18.stl
    {
        type            zeroGradient;
    }
    grain_43_19.stl
    {
        type            zeroGradient;
    }
    grain_43_41.stl
    {
        type            zeroGradient;
    }
    grain_43_47.stl
    {
        type            zeroGradient;
    }
    grain_43_54.stl
    {
        type            zeroGradient;
    }
    grain_43_56.stl
    {
        type            zeroGradient;
    }
    grain_43_59.stl
    {
        type            zeroGradient;
    }
    grain_44_23.stl
    {
        type            zeroGradient;
    }
    grain_44_25.stl
    {
        type            zeroGradient;
    }
    grain_44_29.stl
    {
        type            zeroGradient;
    }
    grain_44_34.stl
    {
        type            zeroGradient;
    }
    grain_44_36.stl
    {
        type            zeroGradient;
    }
    grain_44_41.stl
    {
        type            zeroGradient;
    }
    grain_45_15.stl
    {
        type            zeroGradient;
    }
    grain_45_32.stl
    {
        type            zeroGradient;
    }
    grain_45_33.stl
    {
        type            zeroGradient;
    }
    grain_45_45.stl
    {
        type            zeroGradient;
    }
    grain_45_49.stl
    {
        type            zeroGradient;
    }
    grain_45_58.stl
    {
        type            zeroGradient;
    }
    grain_47_3.stl
    {
        type            zeroGradient;
    }
    grain_47_11.stl
    {
        type            zeroGradient;
    }
    grain_47_14.stl
    {
        type            zeroGradient;
    }
    grain_47_20.stl
    {
        type            zeroGradient;
    }
    grain_47_22.stl
    {
        type            zeroGradient;
    }
    grain_47_57.stl
    {
        type            zeroGradient;
    }
    grain_48_0.stl
    {
        type            zeroGradient;
    }
    grain_48_29.stl
    {
        type            zeroGradient;
    }
    grain_48_37.stl
    {
        type            zeroGradient;
    }
    grain_48_43.stl
    {
        type            zeroGradient;
    }
    grain_48_45.stl
    {
        type            zeroGradient;
    }
    grain_48_46.stl
    {
        type            zeroGradient;
    }
    grain_48_54.stl
    {
        type            zeroGradient;
    }
    grain_49_1.stl
    {
        type            zeroGradient;
    }
    grain_49_25.stl
    {
        type            zeroGradient;
    }
    grain_49_62.stl
    {
        type            zeroGradient;
    }
    grain_50_40.stl
    {
        type            zeroGradient;
    }
    grain_50_51.stl
    {
        type            zeroGradient;
    }
    grain_50_59.stl
    {
        type            zeroGradient;
    }
    grain_51_0.stl
    {
        type            zeroGradient;
    }
    grain_51_4.stl
    {
        type            zeroGradient;
    }
    grain_51_19.stl
    {
        type            zeroGradient;
    }
    grain_51_35.stl
    {
        type            zeroGradient;
    }
    grain_51_56.stl
    {
        type            zeroGradient;
    }
    grain_51_61.stl
    {
        type            zeroGradient;
    }
    grain_52_15.stl
    {
        type            zeroGradient;
    }
    grain_52_25.stl
    {
        type            zeroGradient;
    }
    grain_52_35.stl
    {
        type            zeroGradient;
    }
    grain_52_43.stl
    {
        type            zeroGradient;
    }
    grain_52_53.stl
    {
        type            zeroGradient;
    }
    grain_52_54.stl
    {
        type            zeroGradient;
    }
    grain_52_61.stl
    {
        type            zeroGradient;
    }
    grain_53_4.stl
    {
        type            zeroGradient;
    }
    grain_53_14.stl
    {
        type            zeroGradient;
    }
    grain_53_22.stl
    {
        type            zeroGradient;
    }
    grain_53_27.stl
    {
        type            zeroGradient;
    }
    grain_53_30.stl
    {
        type            zeroGradient;
    }
    grain_54_8.stl
    {
        type            zeroGradient;
    }
    grain_54_15.stl
    {
        type            zeroGradient;
    }
    grain_54_19.stl
    {
        type            zeroGradient;
    }
    grain_54_26.stl
    {
        type            zeroGradient;
    }
    grain_54_27.stl
    {
        type            zeroGradient;
    }
    grain_54_29.stl
    {
        type            zeroGradient;
    }
    grain_54_43.stl
    {
        type            zeroGradient;
    }
    grain_54_48.stl
    {
        type            zeroGradient;
    }
    grain_54_55.stl
    {
        type            zeroGradient;
    }
    grain_55_4.stl
    {
        type            zeroGradient;
    }
    grain_55_5.stl
    {
        type            zeroGradient;
    }
    grain_55_7.stl
    {
        type            zeroGradient;
    }
    grain_55_34.stl
    {
        type            zeroGradient;
    }
    grain_55_38.stl
    {
        type            zeroGradient;
    }
    grain_55_47.stl
    {
        type            zeroGradient;
    }
    grain_55_52.stl
    {
        type            zeroGradient;
    }
    grain_55_59.stl
    {
        type            zeroGradient;
    }
    grain_56_1.stl
    {
        type            zeroGradient;
    }
    grain_56_10.stl
    {
        type            zeroGradient;
    }
    grain_56_19.stl
    {
        type            zeroGradient;
    }
    grain_56_25.stl
    {
        type            zeroGradient;
    }
    grain_56_26.stl
    {
        type            zeroGradient;
    }
    grain_56_37.stl
    {
        type            zeroGradient;
    }
    grain_56_38.stl
    {
        type            zeroGradient;
    }
    grain_56_41.stl
    {
        type            zeroGradient;
    }
    grain_57_5.stl
    {
        type            zeroGradient;
    }
    grain_57_7.stl
    {
        type            zeroGradient;
    }
    grain_57_12.stl
    {
        type            zeroGradient;
    }
    grain_57_13.stl
    {
        type            zeroGradient;
    }
    grain_57_16.stl
    {
        type            zeroGradient;
    }
    grain_57_30.stl
    {
        type            zeroGradient;
    }
    grain_57_32.stl
    {
        type            zeroGradient;
    }
    grain_57_51.stl
    {
        type            zeroGradient;
    }
    grain_57_52.stl
    {
        type            zeroGradient;
    }
    grain_57_53.stl
    {
        type            zeroGradient;
    }
    grain_57_63.stl
    {
        type            zeroGradient;
    }
    grain_58_19.stl
    {
        type            zeroGradient;
    }
    grain_58_59.stl
    {
        type            zeroGradient;
    }
    grain_58_60.stl
    {
        type            zeroGradient;
    }
    grain_59_6.stl
    {
        type            zeroGradient;
    }
    grain_59_20.stl
    {
        type            zeroGradient;
    }
    grain_59_22.stl
    {
        type            zeroGradient;
    }
    grain_59_47.stl
    {
        type            zeroGradient;
    }
    grain_60_9.stl
    {
        type            zeroGradient;
    }
    grain_60_10.stl
    {
        type            zeroGradient;
    }
    grain_60_12.stl
    {
        type            zeroGradient;
    }
    grain_60_25.stl
    {
        type            zeroGradient;
    }
    grain_60_26.stl
    {
        type            zeroGradient;
    }
    grain_60_38.stl
    {
        type            zeroGradient;
    }
    grain_60_40.stl
    {
        type            zeroGradient;
    }
    grain_60_56.stl
    {
        type            zeroGradient;
    }
    grain_61_0.stl
    {
        type            zeroGradient;
    }
    grain_61_18.stl
    {
        type            zeroGradient;
    }
    grain_61_23.stl
    {
        type            zeroGradient;
    }
    grain_61_29.stl
    {
        type            zeroGradient;
    }
    grain_61_32.stl
    {
        type            zeroGradient;
    }
    grain_61_35.stl
    {
        type            zeroGradient;
    }
    grain_61_45.stl
    {
        type            zeroGradient;
    }
    grain_61_46.stl
    {
        type            zeroGradient;
    }
    grain_61_49.stl
    {
        type            zeroGradient;
    }
    grain_62_8.stl
    {
        type            zeroGradient;
    }
    grain_62_17.stl
    {
        type            zeroGradient;
    }
    grain_62_18.stl
    {
        type            zeroGradient;
    }
    grain_62_35.stl
    {
        type            zeroGradient;
    }
    grain_62_43.stl
    {
        type            zeroGradient;
    }
    grain_62_58.stl
    {
        type            zeroGradient;
    }
    grain_63_1.stl
    {
        type            zeroGradient;
    }
    grain_63_8.stl
    {
        type            zeroGradient;
    }
    grain_63_13.stl
    {
        type            zeroGradient;
    }
    grain_63_33.stl
    {
        type            zeroGradient;
    }
    grain_63_35.stl
    {
        type            zeroGradient;
    }
    grain_63_41.stl
    {
        type            zeroGradient;
    }
    grain_63_45.stl
    {
        type            zeroGradient;
    }
    grain_63_48.stl
    {
        type            zeroGradient;
    }
    grain_63_53.stl
    {
        type            zeroGradient;
    }
    grain_63_61.stl
    {
        type            zeroGradient;
    }
    grain_64_6.stl
    {
        type            zeroGradient;
    }
    grain_64_28.stl
    {
        type            zeroGradient;
    }
    grain_64_35.stl
    {
        type            zeroGradient;
    }
    grain_64_43.stl
    {
        type            zeroGradient;
    }
    grain_64_46.stl
    {
        type            zeroGradient;
    }
    grain_65_6.stl
    {
        type            zeroGradient;
    }
    grain_65_35.stl
    {
        type            zeroGradient;
    }
    grain_65_62.stl
    {
        type            zeroGradient;
    }
    grain_66_6.stl
    {
        type            zeroGradient;
    }
    grain_66_12.stl
    {
        type            zeroGradient;
    }
    grain_66_26.stl
    {
        type            zeroGradient;
    }
    grain_66_37.stl
    {
        type            zeroGradient;
    }
    grain_66_45.stl
    {
        type            zeroGradient;
    }
    grain_66_47.stl
    {
        type            zeroGradient;
    }
    grain_66_49.stl
    {
        type            zeroGradient;
    }
    grain_66_53.stl
    {
        type            zeroGradient;
    }
    grain_67_1.stl
    {
        type            zeroGradient;
    }
    grain_67_12.stl
    {
        type            zeroGradient;
    }
    grain_67_25.stl
    {
        type            zeroGradient;
    }
    grain_67_54.stl
    {
        type            zeroGradient;
    }
    }